[
    {
        "name": "HU-267116198",
        "review": "Stephen and Sandy are awesome!  Super friendly, very reasonable, and easy to work with.  Products are great, and the installation is high quality and efficient.  Highly recommend!",
        "rating": 5
    },
    {
        "name": "Andrea Lawrence",
        "review": "SOTA Window Coverings is an outstanding company.  Sandy and Stephen are a pleasure to work with and their professionalism and expertise can't be beat.  My plantation shutters arrived on time, the measurements were spot on and the shutters were installed with perfection.  I highly recommend SOTA Window Coverings.",
        "rating": 5
    },
    {
        "name": "Pamela Maida",
        "review": "Steve and Sandy are delightful. They were professional, knowledgeable, and efficient.  I cannot image a more pleasant experience. I strongly recommend them.",
        "rating": 5
    },
    {
        "name": "Monica Hunter",
        "review": "This was one of the most stress free experience of my life. Sota Window Coverings excelled from the measurements to installation. They arrived when they said they would and it all went very smoothly. I was amazed at the difference these newly installed plantation shutters made to my condo.",
        "rating": 5
    },
    {
        "name": "Melissa Ruelke",
        "review": "We have had such a wonderful experience with SOTA Window Coverings from start to finish!  They are very professional.  Precision craftsmanship, custom made unique for each window.  Sandy and Stephen are very pleasant to conduct business with and I would highly recommend them to anyone looking to improve the interior of their house.",
        "rating": 5
    },
    {
        "name": "gillianforgenie",
        "review": "I had my living room glass slide in doors done with shutters. I loved it so much that I decided to have all of the windows in my home done. The work and service I received  was excellent.  I have been  recommending SOTA WINDOW to all of my friends, family and clients.",
        "rating": 5
    },
    {
        "name": "vaju24k",
        "review": "I hired Sota Window Coverings to fit plantation shutters in several of my new homes. They were very easy to schedule, on time, courteous and hardworking. The price for their services was reasonable for their quality. I am extremely satisfied with the quality of their services and would highly recommend them family and friends.",
        "rating": 5
    },
    {
        "name": "Andee Forster",
        "review": "I recently had plantations shutters and wood blinds installed in my home in Boca Raton, Florida. Working with SOTA window coverings was a great experience. From our first meeting to installation, it was perfect. I am so pleased with how everything looks and how professional the whole experience was. I plan on using SOTA for all of my remaining windows in my home.",
        "rating": 5
    },
    {
        "name": "Ruth Resnick",
        "review": "I commissioned SOTA Window Coverings (Steven and Sandy Watson) to cover all of the windows in my new home. This involved a combination of plantation shutters, solar shades as well as Pirouettes. Not only did they provide an outstanding, flawless product but their customer service is incredible! Steven and Sandy always arrived on time. They listened attentively to my wants and needs. They were unbelievably knowledgeable about their products and made excellent suggestions (based on their expertise) on what would work best for each of my rooms. They were very professional and met all of our deadlines. In fact, given our time constraints, they delivered on their promises and 'made it happen'! Although, some of our windows were a challenge, given their height and location, Steven and David, did a marvelous job in installing the window treatments and their work ethic and performance was meticulous!   I found them very easy to work with and I admired their honesty and integrity. I have no hesitation to recommend them. They are fabulous!",
        "rating": 5
    },
    {
        "name": "Devon Bowie",
        "review": "I recently had Sota windows installed plantation shutters in my Home in Highland Beach. His job performance and professionalism was impeccable, I would certainly recommend him to my friends.",
        "rating": 5
    },
    {
        "name": "kismet1950",
        "review": "Sandy and Steve were a pleasure to work with.  Their explanation of our choices and options for plantation shutters was easy to understand.  We felt as if we were discussing our choices with family.  The installation was on-time and professional.  The shutters are beautiful and the quality is exceptional.  We would highly recommend them to anyone.",
        "rating": 5
    },
    {
        "name": "Michele McDermott",
        "review": "Steve and Sandy created fabulous Plantation shutters for my home. They are both highly professional, and their knowledge and experience was evident throughout the project. They provided me best experience possible. From the first measurement through the final installation, these pros are a class act. They complete projects within  promised  timelines with precision and transformed my bland windows into functional features in my home. I highly recommend using Sota Window Coverings.",
        "rating": 5
    },
    {
        "name": "simsage",
        "review": "I am extremely impressed with the shutters that SOTA did for me,  so much so that I am having Steven & his crew do the shutters on the sliders off my bedroom patio. They are very detailed oriented, precise in their work,  work to time, and are very agreeable to small changes. I was recommended to them by a friend. I highly reccomend SOTA and I wish I could find other companies that are as reliable and dependable like SOTA",
        "rating": 5
    },
    {
        "name": "queenanne325",
        "review": "Sota Window coverings did an excellent job on covering our windows with beautiful plantation shutters.  Steven worked timely and was very clean while he installed the blinds.  The quality of their products are top notch.  They were professional and very reasonable with their quotes.  The shutters are more beautiful than I expected.  Well done!",
        "rating": 5
    }
]